	IDENTIFICATION DIVISION.
	PROGRAM-ID. WAGE.
	DATA DIVISION.
	WORKING-STORAGE SECTION.
	01		HOURS	PIC	99.
	01		RATE	PIC	99V99.
	01		WAGES	PIC	999.99.
	01		MORE-DATA	PIC	XXX	VALUE	"YES".
	PROCEDURE DIVISION.
	100-MAIN.
	PERFORM UNTIL MORE-DATA = "NO "
		DISPLAY "ENTER HOURS AS A TWO DIGIT NUMBER"
		ACCEPT HOURS
		DISPLAY "ENTER RATE IN NN.NN FORMAT (2 DECIMAL)"
		ACCEPT RATE
		MULTIPLY RATE BY HOURS GIVING WAGES
		DISPLAY "WAGES ARE ", WAGES
		DISPLAY "IS THERE MORE DATA (YES/NO) ?"
		ACCEPT MORE-DATA
	END-PERFORM
	STOP RUN.
