	IDENTIFICATION DIVISION.
	PROGRAM-ID. TRIEUR.


	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SOURCE-COMPUTER. PC-I686.
	OBJECT-COMPUTER. PC-I686.

	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
		SELECT ENTER-DATA	ASSIGN TO DISK "NON_SORT.DAT"
		       ORGANIZATION IS LINE SEQUENTIAL.
		SELECT OUT-DATA		ASSIGN TO DISK "SORTED.DAT"
		       ORGANIZATION IS LINE SEQUENTIAL.
		SELECT SORTED-DATA      ASSIGN TO DISK "SRT-TMP.DAT".
      *		SELECT SORTED-DATA     	ASSIGN TO SYSWORK.
      * SYSWORK = zone de travail "interne" a l OS/COBOL
      * Mais n est pas toujours present sur PC


	DATA DIVISION.
	FILE SECTION.
	FD  ENTER-DATA.
	01  IN-REC.
	    05  SET-NAME		PICTURE X(100).
	SD  SORTED-DATA.
	01  SRT-REC.
	    05  SORTED-NAME		PICTURE X(100).
	FD  OUT-DATA.
	01  OUT-REC.
	    05  OUT-SET-NAME		PICTURE X(100).

	WORKING-STORAGE SECTION.
	01  ARE-THERE-MORE-RECORDS	PICTURE XXX VALUE 'YES'.
	77  CURRENT-NAME		PICTURE X(100).
	77  CURRENT-ENTRIES		PICTURE 999.
	01  IS-FIRST-ENTRY		PICTURE XXX VALUE 'YES'.
	    88 NOT-FIRST-ENTRY			    VALUE 'NO '.


	PROCEDURE DIVISION.
	100-MAIN-MODULE.
	    SORT SORTED-DATA ON ASCENDING KEY SORTED-NAME OF SRT-REC
	    	 USING ENTER-DATA
		 OUTPUT PROCEDURE 200-AFTER-SORT
	    STOP RUN.

	200-AFTER-SORT.
	    MOVE 'YES' TO IS-FIRST-ENTRY
	    OPEN OUTPUT OUT-DATA
	    PERFORM UNTIL ARE-THERE-MORE-RECORDS = 'NO'
      * Ceci est un commentaire... COL7 a * == commentaire
      *     	READ SORTED-DATA
      * On ne READ pas un SORT
      	      	RETURN SORTED-DATA
		     AT END
			  MOVE 'NO ' TO ARE-THERE-MORE-RECORDS
		     NOT AT END
		     	  PERFORM 300-WRITE-ROUTINE
		END-RETURN
	    END-PERFORM
	    DISPLAY "Total of entries : " CURRENT-ENTRIES
	    CLOSE OUT-DATA.

	300-WRITE-ROUTINE.
	    IF  SRT-REC IS NOT = SPACES
		IF  IS-FIRST-ENTRY = 'YES'
		    MOVE SORTED-NAME TO CURRENT-NAME
		    MOVE 1 TO CURRENT-ENTRIES
		    MOVE 'NO ' TO IS-FIRST-ENTRY
		ELSE
		    ADD 1 TO CURRENT-ENTRIES
      		    MOVE SORTED-NAME TO CURRENT-NAME
		END-IF
		MOVE CURRENT-NAME TO OUT-SET-NAME
		WRITE OUT-REC
	    END-IF.

	END PROGRAM TRIEUR.
